In [1]:
import seaborn as sns
import pandas as pd

In [3]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
df = titanic.loc[:,['age','sex','class','fare','survived']]
df.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [9]:
print(len(df))

891

In [10]:
groupall = df.groupby(['class'])
print(groupall.head())

     age     sex   class     fare  survived
0   22.0    male   Third   7.2500         0
1   38.0  female   First  71.2833         1
2   26.0  female   Third   7.9250         1
3   35.0  female   First  53.1000         1
4   35.0    male   Third   8.0500         0
5    NaN    male   Third   8.4583         0
6   54.0    male   First  51.8625         0
7    2.0    male   Third  21.0750         0
9   14.0  female  Second  30.0708         1
11  58.0  female   First  26.5500         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1
23  28.0    male   First  35.5000         1

In [15]:
average = group.mean()
print(average)

for key, group in groupall:
    print("key : ",key)
    print('group count : ',len(group))
    print('group mean \n: ',group.mean())
    print('group max age : ',group.age.max())
    print('group survived : ',group.survived.sum())
    print('group survived percent : ',(group.survived.sum()/len(group)).round(1)*100)
    print('\n')

age         25.140620
fare        13.675550
survived     0.242363
dtype: float64
key :  First
group count :  216
group mean
:  age         38.233441
fare        84.154687
survived     0.629630
dtype: float64
group max age :  80.0
group survived :  136
group survived percent :  60.0


key :  Second
group count :  184
group mean
:  age         29.877630
fare        20.662183
survived     0.472826
dtype: float64
group max age :  70.0
group survived :  87
group survived percent :  50.0


key :  Third
group count :  491
group mean
:  age         25.140620
fare        13.675550
survived     0.242363
dtype: float64
group max age :  74.0
group survived :  119
group survived percent :  20.0

In [16]:
groupThird = groupall.get_group('Third')

In [17]:
print(groupThird.mean())

age         25.140620
fare        13.675550
survived     0.242363
dtype: float64

In [18]:
group_two = df.groupby(['class','sex'])
for key, group in group_two:
    print('key : ',key)
    print('group count : ',len(group))
    print('group survived percent : ',(group.survived.sum()/len(group)).round(1)*100)
    print('\n')

key :  ('First', 'female')
group count :  94
group survived percent :  100.0


key :  ('First', 'male')
group count :  122
group survived percent :  40.0


key :  ('Second', 'female')
group count :  76
group survived percent :  90.0


key :  ('Second', 'male')
group count :  108
group survived percent :  20.0


key :  ('Third', 'female')
group count :  144
group survived percent :  50.0


key :  ('Third', 'male')
group count :  347
group survived percent :  10.0

In [20]:
groupThirdFemale = group_two.get_group(('Third','female'))
print(groupThirdFemale.mean())
groupThirdFemale.head()

age         21.75000
fare        16.11881
survived     0.50000
dtype: float64

     age     fare  survived
2   26.0   7.9250         1
8   27.0  11.1333         1
10   4.0  16.7000         1
14  14.0   7.8542         0
18  31.0  18.0000         0